# Функции и процессы

Существует два уровня описания функций и процессов: **короткий** (быстрый) и **подробный** (полный).  
Отличие только в синтаксисе — по факту создаётся один и тот же объект.

---

## 1. Короткий стиль
Параметры перечисляются «как есть», слоты подбираются автоматически.
(можно указать название в <>, тип после :, и значение по умолчанию после =) 
Поддерживаются **только одиночные** параметры.

```ts
def sum(a, b, c: variable): // функция
    c = num("a + b")       

proc print(text):        // процесс
    player::message(text)
```

## 2. Подробный стиль
Каждому параметру явно указывается тип, имя, отображаемое имя, слоты. (можно также указать тип данных и значение по умолчанию)  
Поддерживаются **все типы**: одиночные, множественные, маркеры.

```ts
function sum(
    singular: a<"1 число", 12, 21>: number = 0,
    single: b<"2 число", 14, 23>: number = 0,
    one: result<"Результат", 10, 19): variable
):
    variable = num("a + b")
```

---

## 3. Мета-блок `<…>` — иконка, название, описание

После имени можно добавить метаданные:
```ts
// Работает со всеми функциями и процессами
def имя<"Отображаемое название", item("diamond"), "Описание">:
```

| Позиция | Тип | Назначение |
|---------|-----|------------|
| 1 | Текст | Название в GUI |
| 2 | Предмет | Иконка (любой `item()`) |
| 3 | Текст | Описание |

Пример:
```ts
def give_kit<"Выдать набор", item("chest"), "Выдаёт стартовые вещи">(p, kit):
```
---

## 4. Формат параметров подробного стиля

```
тип: имя<"отображаемое", слот(ы) [, флаги]>: тип_данных = значение_по_умолчанию
```

Допустимые **алиасы типов**:
- `singular` = `single` = `one`
- `plural` = `multi`
- `enum` = `marker`

### 4.1 singular (одиночное значение)
```
singular: radius<"Радиус", 13, 22>: number = 5
```
- radius - название*
- "Радиус" - отображаемое название*
- 13 - слот* | 22 - слот описания*
- number - тип значения
- 5 - значение по умолчанию

### 4.2 plural (Множество значений)
```
plural: items<"Предметы", [11,12,13], [20,21,22], "false">: text = ["sword", "bow"]
```
- items - название*
- "Предметы" - отображаемое название*
- \[11, 12, 13\] - слоты* | \[20, 21, 22\] - слоты описания*
- "false" - не игнорировать пустые значения
- item - тип значения
- \["sword", "bow"\] - список по умолчанию

### 4.3 enum (Маркер)
```
enum: mode<"Режим", 7, 0>: [
    survival<"Выживание", item("iron_sword")>,
    creative<"Креатив", item("grass_block")>
]
```
- mode - название*
- "Режим" - отображаемое название*
- 7 - слот маркера*
- 0 - индекс значения по умолчанию
- survival и creative - элементы маркера*
- "Выживание" и "Креатив" - отображаемые названия
- item() - отображаемые предметы

---

## 5. Вызов

### 5.1 Функции
```ts
call function sum(3, 7, l`result`)
call function (func)        // через переменную, без аргументов
```

### 5.2 Процессы

Процессы можно вызывать **с настройками** в `<>`:

| Параметр `<>` | Возможные значения |
|---------------|--------------------|
| **передача локальных переменных** | `COPY` / `DONT_COPY` / `SHARE` |
| **выбор цели** | `CURRENT_SELECTION` / `CURRENT_TARGET` / `FOR_EACH_IN_SELECTION` / `NO_TARGET` |


```ts
call process heal(player, 5)
call process<"SHARE", "FOR_EACH_IN_SELECTION"> heal(player, 5)  // настройки копирования и выборки
call process (heal_proc)                        
```

---

## 6. Кастомный return

Так как код не может вернуть variable параметр если он перенесён в другую функцию из-за продолжения,
был придуман `return значения`, который заменится на присвоение после компиляции.

Укажите количество возвращаемых значений после стрелки:
```ts
def swap(a, b) -> 2:
    return b, a
```

При вызове заберите столько же переменных:
```ts
call function swap(x, y) -> new_x, new_y
```
